#+Title: Emacs Config
#+Author: Nishant Maniam
#+Date: 2020-01-01
*** Company for auto-completion
Use ~C-n~ and ~C-p~ to navigate the tooltip.
#+BEGIN_SRC emacs-lisp
  (use-package company
  :diminish company-mode
    :hook (prog-mode . company-mode)
    :config
    (setq company-minimum-prefix-length 1
          company-idle-delay 0.1
          company-selection-wrap-around t
          company-tooltip-align-annotations t
          company-dabbrev-downcase nil
          company-frontends '(company-pseudo-tooltip-frontend ; show tooltip even for single candidate
                              company-echo-metadata-frontend))
    (with-eval-after-load 'company
      (define-key company-active-map (kbd "C-n") 'company-select-next)
      (define-key company-active-map (kbd "C-p") 'company-select-previous)))
#+END_SRC

#+RESULTS:
| company-mode | hes-mode | highlight-operators-mode | highlight-numbers-mode | electric-pair-mode |

*** Org Mode
Some minimal org mode tweaks: org-bullets gives our headings (h1, h2, h3...) a more visually pleasing look.
#+BEGIN_SRC emacs-lisp
  (use-package org
  :hook ((org-mode . visual-line-mode) (org-mode . org-indent-mode))
  :config (setq org-log-done t)
  (define-key global-map "\C-ca" 'org-agenda) (define-key global-map "\C-cl" 'org-store-link))
  (setq org-agenda-files (list "~/notes/work.org" "~/notes/WhisperFlows.org"))
  (use-package org-bullets :hook (org-mode . org-bullets-mode))
#+END_SRC

#+RESULTS:
| org-bullets-mode | org-indent-mode | visual-line-mode | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-block-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes |

